Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: AddColumn($self, ColumnInfo=None, Name=None, DisplayName=None, DataType=None, DataKind=None, DefaultUsageType=None) -- Добавить новый столбец Аргументы: ColumnInfo Любой объект с метаданными столбца, например, другой столбец. Обязательный атрибут Name, опциональные: DisplayName, DataType, DataKind, DefaultUsageType. Name: str Имя столбца. DisplayName: str Метка столбца. DataType: int Тип данных столбца. DataKind: int Вид данных столбца. DefaultUsageType: int Назначение столбца по умолчанию. Результат: Новый столбец таблицы. Неуказанным атрибутам нового столбца присваиваются значения по умолчанию.
en: AddColumn($self, ColumnInfo=None, Name=None, DisplayName=None, DataType=None, DataKind=None, DefaultUsageType=None) -- Add new column Arguments: ColumnInfo Any object with the column metadata, for example, another column. Name is a required attribute; DisplayName, DataType, DataKind, DefaultUsageType are optional. Name: str Column name. DisplayName: str Column caption. DataType: int Column data type. DataKind: int Column data kind. DefaultUsageType: int Column default usage type. Result: A new table column. Unspecified attributes of the new column are initialized with default values.

source: Append($self, /) -- Добавить новую строку Результат: None
en: Append($self, /) -- Append new row Result: None

source: AssignColumns($self, source, /) -- Создать столбцы по описаниям Аргументы: source: Iterable Объект, возвращающий итератор по объектам с метаданными столбца, например, InputTable.Columns.Объект с метаданными столбца должен содержать атрибут Name и опционально: DisplayName, DataType, DataKind, DefaultUsageType.
en: AssignColumns($self, source, /) -- Create columns by decriptions Arguments: source: Iterable The object returning iterator over the column metadata objects, for example, InputTable.Columns. The column metadata object must contain the Name attribute and optionally DisplayName, DataType, DataKind, DefaultUsageType.

source: Сообщение "%s" операции "%s" не является HTTP-сообщением
en: "%s" message of "%s" operation is not HTTP message

source: %d:%d:%d.%d не является допустимым значением времени
en: %d:%d:%d.%d is not a valid time value

source: ClearColumns($self, /) -- Удалить все столбцы Результат: None
en: ClearColumns($self, /) -- Delete all columns Result: None

source: DeleteColumn($self, col, /) -- Удалить столбец по индексу или имени Аргументы: col: Union[int, str] Индекс или имя удаляемого столбца. Результат: None
en: DeleteColumn($self, col, /) -- Delete column by index or name Arguments: col: Union[int, str] Index or name of deleted column. Result: None

source: Get($self, row, col, /) -- Получить значение ячейки таблицы Аргументы: row: int Индекс строки таблицы col: Union[int, str] Индекс или имя столбца таблицы Результат: Значение ячейки в соответствие с типом столбца (bool, int, str, float или datetime.datetime). Если ячейка пустая, то возвращается None.
en: Get($self, row, col, /) -- Get table cell value Arguments: row: int Table row index col: Union[int, str] Index or name of table column Result: Cell value according to the column type (bool, int, str, float or datetime.datetime). If the cell is null, None is returned.

source: GetColumn($self, col, /) -- Получить столбец по индексу или имени Аргументы: col: Union[int, str] Индекс или имя столбца таблицы Результат: Столбец таблицы
en: GetColumn($self, col, /) -- Get column by index or name Arguments: col: Union[int, str] Index or name of table column Result: Table column

source: InsertColumn($self, Index, ColumnInfo=None, Name=None, DisplayName=None, DataType=None, DataKind=None, DefaultUsageType=None) -- Вставить новый столбец по указанному индексу Аргументы: Index: int Индекс, по которому вставляется столбец. ColumnInfo Любой объект с метаданными столбца, например, другой столбец. Обязательный атрибут Name, опциональные: DisplayName, DataType, DataKind, DefaultUsageType. Name: str Имя столбца. DisplayName: str Метка столбца. DataType: int Тип данных столбца. DataKind: int Вид данных столбца. DefaultUsageType: int Назначение столбца по умолчанию. Результат: Новый столбец таблицы. Неуказанным атрибутам нового столбца присваиваются значения по умолчанию.
en: InsertColumn($self, Index, ColumnInfo=None, Name=None, DisplayName=None, DataType=None, DataKind=None, DefaultUsageType=None) -- Insert a new column according to the given index Arguments: Index: int The index according to which the column is inserted. ColumnInfo Any object with the column metadata, for example, another column. Name is a required attribute; DisplayName, DataType, DataKind, DefaultUsageType are optional. Name: str Column name. DisplayName: str Column caption. DataType: int Column data type. DataKind: int Column data kind. DefaultUsageType: int Column default usage type. Result: A new table column. Unspecified attributes of the new column are initialized with default values.

source: IsNull($self, row, col, /) -- Проверить, установлено ли значение в ячейке таблицы Аргументы: row: int Индекс строки таблицы col: Union[int, str] Индекс или имя столбца таблицы Результат: True, если ячейка таблицы пустая. False, если в ячейке есть значение.
en: IsNull($self, row, col, /) -- Check if there is a value in the table cell Arguments: row: int Table row index col: Union[int, str] Index or name of table column Result: True, if the table cell is null. False, if the table cell contains a value.

source: Set($self, col, value, /) -- Установить значение в ячейку добавленной строки Аргументы: col: Union[int, str] Индекс или имя столбца таблицы value: Union[bool, int, str, float, datetime.datetime, None] Значение совместимого со столбцом типа (bool, int, str, float, datetime.datetime, datetime.date, datetime.time, time.struct_time и их наследники) или None Результат: None
en: Set($self, col, value, /) -- Set value in the cell of the appended row Arguments: col: Union[int, str] Index or name of table column value: Union[bool, int, str, float, datetime.datetime, None] The value of the type compatible with column (bool, int, str, float, datetime.datetime, datetime.date, datetime.time, time.struct_time and their descendants) or None Result: None

source: Ошибка при выполнении служебного кода регистрации загрузки расширений Python
en: Error executing service code of Python extensions loading registration

source: Преобразование переданного объекта Python в значение переменного типа не поддерживается
en: Transformation of the passed Python object into the variant type value is not supported

source: Преобразование переданного значения переменного типа в объект Python не поддерживается
en: Transformation of the passed variant type value into the Python object is not supported

source: "%s" не является HTTP-операцией
en: "%s" is not HTTP operation

source: Ошибка при выполнении служебного кода интеграции с Python
en: Error executing service code for integration with Python

source: Выполнение Python-кода
en: Python script execution

source: Индекс выходного набора %d вне диапазона [%d, %d]
en: The output dataset index %d is out of [%d, %d] range

source: Формирование выходных наборов
en: Generating output datasets

source: Выходной набор
en: Output dataset

source: Экстремальные значения
en: Extremes

source: Расчет дополнительных характеристик
en: Calculating additional features

source: "%s" не является HTTP-портом
en: "%s" is not HTTP port

source: Сканирование входных данных
en: Scanning input data

source: Итоговая таблица
en: Summary table

source: Необрабатываемый тип данных
en: Unhandled data type

source: Качество данных
en: Data Quality

source: Оценка качества данных
en: Data quality assessment

source: Изменение
en: Changed

source: Нельзя исключить все столбцы из дальнейшей обработки
en: Failed to exclude all columns from the further processing

source: Параметры полей
en: Field Features

source: Части сообщения "%s" не сопоставлен элемент схемы
en: "%s" message part has no schema element mapping

source: Изменение параметров полей
en: Change field features

source: Нет входной таблицы замен с GUID = %s
en: No input replacement table with GUID = %s

source: Замена:
en: Replace:

source: Заменен
en: Replaced

source: (табл)
en: (table)

source: Замена значений полей
en: Replace field values

source: При анализе шаблона URL replacement "%s" возникли ошибки
en: Errors occurred while analysing "%s" URL replacement template

source: Количество полей входной таблицы замен меньше 2
en: The field number in the input replacement table is less than 2

source: Тип данных входной таблицы замен не соответствует типу данных заменяемого поля
en: The input replacement table data type does not match the replaced field data type

source: Значение дублируется в таблице замен
en: Duplicate value in the replacement table

source: Ошибка получения входного типа данных для "%s"
en: Error getting input data type for "%s"

source: Задано неверное регулярное выражение
en: Invalid regular expression specified

source: Ошибка преобразования типа значения в таблице замен для "%s"
en: Error converting value type in the replacement table for "%s"

source: Не назначены поля входной таблицы замен
en: No fields in the input replacement table specified

source: Замена (перем.):
en: Replace (Var.):

source: Замена (переменные)
en: Replace (variables)

source: Невозможно преобразовать целое число %d к типу "%s": %s
en: Failed to convert integer %d to "%s" type: %s

source: Замена значений переменных
en: Replace variable values

source: Ко входному порту "%s" не подключена связь, порт содержит обязательные поля
en: Link to input port "%s" does not exist, the port contains required fields

source: Поле входного набора "%s" назначено несуществующему параметру "%s"
en: "%s" input dataset field has been assigned for nonexistent "%s" parameter

source: Тип данных поля входного набора "%s" несовместим с телом запроса
en: Data type of the input dataset field "%s" is incompatible with request body

source: Тип данных поля входного набора "%s" несовместим с параметром "%s"
en: Data type of the input dataset field "%s" is incompatible with "%s" parameter

source: Время ожидания выполнения истекло.
en: Execution timeout expired.

source: Код состояния HTTP
en: HTTP Status Code

source: Ответ сервиса
en: Service Response

source: Идентификатор запроса
en: Request identifier

source: Ответ сервера
en: Server response

source: Ошибка при формировании HTTP-запроса из строки #%d входного набора: %s
en: Error while generating HTTP request from row #%d of the input dataset: %s

source: Подключение к REST-сервису
en: Connection to REST service

source: Ошибка при выполнении запроса, сформированного из строки %d входного набора: %s
en: Error executing request generated from row %d of the input dataset: %s

source: Кодировка символов "%s" ответа HTTP не поддерживается
en: Character encoding "%s" not supported for HTTP response

source: Заголовок "%s" уже присутствует в запросе
en: "%s" header already exists in the request

source: Получен недопустимый Content-Type: "%s", ожидается: "%s"
en: Invalid Content-Type received: "%s", expected: "%s"

source: REST-запрос
en: REST Request

source: Выполняет запрос через подключение к REST-сервису
en: Request execution through REST service connection

source: Сэмплинг: %s, %s
en: Sampling: %s, %s

source: Заголовок "%s: %s" уже присутствует в запросе
en: "%s: %s" header already defined in the request

source: Формирование репрезентативного подмножества
en: Selection of representative subset

source: Указаны слишком большие значения Глубина истории и/или Горизонт прогноза
en: Too high values are specified for Depth period and/or Forecast horizon

source: Скользящее окно
en: Lag

source: Транспозиция одного или нескольких столбцов данных с использованием скользящего окна
en: Transpose one or several data columns using lag

source: Данный порядок вейвлета не поддерживается
en: This wavelet order is not supported

source: Не указаны столбцы для обработки
en: No columns for processing specified

source: Ошибка в алгоритме сглаживания
en: Error in the smoothing algorithm

source: Задано отрицательное значение параметра Lambda
en: Lambda parameter set to negative

source: Период сглаживания не может быть меньше двух
en: The smoothing period cannot be less than two

source: Сглаживание:
en: Smoothing:

source: Ошибка при формировании HTTP-заголовков
en: Error while generating HTTP headers

source: Сглаживание
en: Smoothing

source: Сглаживание данных с помощью вейвлетов
en: Data smoothing with wavelets

source: Номер кластера
en: Cluster number

source: Расстояние до узла
en: Distance to node

source: Номер узла
en: Node number

source: |Координата
en: |Coordinate

source: |Значение
en: |Value

source: Переполнение количества строк выходного набора данных "Центры кластеров"
en: Row count overflow of the "Cluster Centers" output dataset

source: Ошибка при выполнении запроса к URL '%s': ответ сервера не обработан, так как Content-Type: %s не зарегистрирован
en: Error executing request to URL '%s': server response was not processed because Content-Type: %s had not been registered

source: Модель не построена. Необходимо обучить узел перед применением
en: Model not trained. The node requires training before use

source: Задан некорректный размер сети по %s: %d
en: Invalid network size for %s: %d

source: Тип самоорганизующейся сети "%s" не поддерживается
en: "%s" type of self-organizing network not supported

source: Модель не соответствует входным данным
en: Model does not match the input data

source: Координаты узлов
en: Coordinates of nodes

source: Разбиение на кластеры
en: Clustering

source: Самоорг. сеть:
en: SONN:

source: Обучение сети
en: Training the network

source: Не задан контекст экспорта
en: No export context specified

source: Число интервалов должно быть положительным
en: The number of intervals must be positive

source: Самоорганизующаяся сеть
en: Self-Organizing Network

source: Кластеризация данных самоорганизующимися нейронными сетями
en: Data clustering by self-organizing neural networks

source: Сортировка данных
en: Data sorting

source: Подключение к БД
en: Connecting to DB

source: Ошибка при выполнении запроса к базе данных.
en: Error executing DB query.

source: Ошибка при выполнении %d-й команды скрипта
en: Error running command %d of the script

source: Ошибка при создании HTTP-клиента
en: Error creating HTTP client

source: Не установлено соединение с базой данных
en: No connection with database

source: Не указан текст SQL-запроса
en: SQL query text not specified

source: Успешное завершение
en: Completed successfully

source: Выполнение SQL скрипта
en: Running SQL script

source: Получение списка таблиц
en: Getting table list

source: Итерации по строкам входных данных
en: Iterating through input data rows

source: Номер строки данных
en: Data row number

source: Ошибка при получении данных HTTP-клиентом: %s
en: Error retrieving data by HTTP client: %s

source: Имя подстановки "%s" одновременно совпадает с именем поля источника данных и переменной. Используется значение поля.
en: Substitution name "%s" matches a data source field name and a variable name simultaneously. The field value is used.

source: Имя параметра "%s" одновременно совпадает с именем поля источника данных и переменной. Используется значение поля.
en: Parameter name "%s" matches a data source field name and a variable name simultaneously. The field value is used.

source: Подключение к БД занято
en: Connection to DB is busy

source: SQL-скрипт
en: SQL Script

source: Выполнение SQL скриптов через настроенное подключение к базе данных
en: Running SQL scripts via a configured database connection

source: Расчёт количества строк
en: Calculating the number of rows

source: Недопустимый тип данных глобального индекса узла: %s
en: Invalid data type of the global node index: %s

source: Не выбрано ни одного узла с данными
en: No data node selected

source: Номер строки %d вне диапазона [%d, %d]
en: Row number %d is out of [%d, %d] range

source: Невозможно создать SOAP-конверт на основе сообщения %s
en: Failed to create SOAP envelope based on %s message

source: Подготовка индексов строк
en: Preparing row indexes

source: Дерево в табл.:
en: Tree to Table:

source: Входное дерево данных
en: Input data tree

source: Выходной набор данных
en: Output dataset

source: Дерево в таблицу
en: Tree to Table

source: Формирование таблицы данных из дерева данных
en: Create data table from data tree

source: Дерево в JSON
en: Tree to JSON

source: Формирование строк JSON из дерева данных
en: Generating JSON strings from a data tree

source: Нижняя граница 95% ДИ
en: Lower bound 95% CI

source: Невозможно создать SOAP-конверт для операции %s
en: Failed to create SOAP envelope for %s operation

source: Верхняя граница 95% ДИ
en: Upper bound 95% CI

source: Не задано поле с наименованиями разгруппированных значений
en: No field with the ungrouped values names specified

source: Не задано поле с разгруппируемыми значениями
en: Ungroupable values field not defined

source: Не определено ни одной связи для идентификаторов групп
en: No links defined for group identifiers

source: Нет связанных полей для построения AVL - дерева
en: No related fields to build AVL tree

source: Ошибка в работе алгоритма разгруппировки! Процесс остановлен.
en: Error in the ungrouping algorithm! The process has been terminated.

source: Не задано тело сообщения
en: Message has no body

source: Группировка исходных данных
en: Grouping initial data

source: Значение сезонного индекса
en: Seasonal index value

source: Значение тренда
en: Trend value

source: Фиксированное (алгоритм)
en: Fixed (algorithm)

source: Разгруппированное значение
en: Ungrouped value

source: Исключено
en: Excluded

source: Разгруппированное (фиксация снята)
en: Ungrouped (unfixed)

source: Разгруппированное
en: Ungrouped

source: Фиксированное (пользователь)
en: Fixed (user)

source: SOAP-конверту передано сообщение, не привязанное к конкретной операции
en: Message not bound to any specific operation was sent to SOAP envelope

source: Фиксированное (пользователь, несогласованное)
en: Fixed (user, inconsistent)

source: Тип значения
en: Value type

source: Код типа значения
en: Value type code

source: Расчет долей
en: Calculating quotas

source: Группировка опорных данных для расчета долей
en: Grouping reference data for quota calculations

source: Округлено
en: Rounded

source: Сезонный индекс
en: Seasonal index

source: Данные для расчета долей
en: Data for quota calculation

source: Разгруппировка: %s
en: Ungroup: %s

source: Разгруппируемые данные
en: Ungrouped data

source: Не SOAP сообщение
en: Non SOAP message

source: Выход разгруппировки
en: Ungroup output

source: Индекс качества разгруппировки
en: Ungrouping quality indicator

source: Показатели качества модели и сезонные индексы
en: Model quality indicators and seasonal indexes

source: Точки набора расположены слишком редко для заданного периода сезонности
en: Set points are too sparse for the given seasonality period

source: В разгруппируемом наборе каждой группе должна соответствовать единственная строка
en: Each group in the ungroupable set must match a single row

source: В опорном наборе отсутствуют данные, принадлежащие данной группе
en: No data belonging to this group in the reference set

source: Групповой временной ряд пуст
en: Group time series is empty

source: В опорном наборе отсутствуют данные, пригодные для разгруппировки
en: No data suitable for ungrouping in the reference set

source: Группа состоит из одного элемента
en: The group consists of one element

source: Тело SOAP в RPC-операции не поддерживает стиль RPC
en: SOAP body in RPC operation does not support RPC style

source: Код типа за пределами допустимых значений
en: Type code out of allowable ranges

source: Неверный тип ключа временного ряда
en: Invalid time series key type

source: На итерации %d матрица (%d x %d) сингулярна или плохо обусловлена: U[%d;%d] = 0
en: (%1:d x %2:d) matrix is singular or ill-conditioned: U[%3:d;%4:d] = 0 in %0:d iteration

source: Не удается обеспечить нужное число степеней свободы
en: Failed to provide the required number of degrees of freedom

source: Для модели разгруппировки не установлен Engine
en: Engine not set for the ungroup model

source: Проверка аналитического градиента завершилась неудачно
en: Analytical gradient verification failed

source: Обнаружено бесконечное значение оптимизируемой функции или ее градиента
en: The infinite value of the optimized function or its gradient was detected

source: На итерации %d матрица (%d x %d) содержит нулевой столбец №%d
en: (%1:d x %2:d) matrix contains zero column #%3:d in %0:d iteration

source: На итерации %d матрица (%d x %d) содержит нулевую строку №%d
en: (%1:d x %2:d) matrix contains zero row #%3:d in %0:d iteration

source: Ошибка при подготовке системы уравнений
en: Error while preparing the system of equations

source: Стиль кодировки "%s" для SOAP версии %s не поддерживается
en: "%s" encoding style for %s SOAP version not supported

source: Ошибка при подготовке структур данных системы уравнений
en: Error while preparing data structures for the system of equations

source: Ошибка %d при решении системы уравнений на итерации %d
en: Error %d when solving the system of equations at iteration %d

source: Неизвестный тип данных поля времени
en: Unknown time field data type

source: Разгруппировка
en: Ungroup

source: Разгруппировка данных
en: Ungroup data

source: Объединение
en: Union

source: Префикс метки результирующего столбца
en: Result column caption prefix

source: Префикс имени "%s" не является правильным идентификатором
en: "%s" name prefix is not a valid identifier

source: Нет ни одного активного входа
en: No active inputs

source: Количество строк результирующего набора превысило максимальное значение %d
en: Row count of the result dataset exceeded maximum value %d

source: Добавление BOM (Byte order mark) в начало SOAP-конверта может привести к неспособности некоторых серверов (например, Apache Xerces или Java-служб) обработать запрос
en: Adding a BOM (byte-order mark) at the begginning of a SOAP envelope may prevent some servers (for example, Apache Xerces or Java services) from processing the request

source: Описание функции "%s" не найдено
en: Description of "%s" function not found

source: Префикс имени результирующего столбца
en: Result column name prefix

source: Объединение нескольких наборов данных
en: Union of several datasets

source: конкатенация
en: concatenate

source: Невозможно получить количество строк для узла с идентификатором %d: узел не является массивом
en: Failed to get the row count for the node with identifier %d: the node is not an array

source: Количество строк результирующего дерева превысило максимальное значение %d
en: The number of strings in the resulting tree exceeds the maximum value %d

source: первое активное
en: first active

source: Пространство имен SOAP "%s" не опознано
en: "%s" SOAP namespace not recognized

source: Объединение (дер.):
en: Union (Tree):

source: Объединение (дерево)
en: Tree Union

source: Объединение нескольких деревьев данных
en: Combining multiple data trees

source: Добавляемые переменные
en: Added variables

source: Количество входных портов превысило максимальное значение = %d
en: Number of input ports exceeded the maximum value = %d

source: Количество входных переменных превысило максимальное значение = %d
en: Number of the input variables exceeded the maximum value = %d

source: Соединение (переменные)
en: Variable Union

source: Привязка "%s" должна ссылаться в точности на один тип расширения
en: "%s" binding must specify exactly one extension type

source: Соединение нескольких наборов переменных в один
en: Combine several sets of variables into one
